app2/app/views/people/index.html.erb

      <td><%= people.telephone %></td>
      <td><%= people.group.groupname %></td>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 ORDER BY "groups"."id" ASC LIMIT 1  [["id", 1]]