app2/app/views/people/new.html.erb

SELECT "groups".* FROM "groups"
---
  <%= f.label :groupname %>
  <%= f.collection_select(:group_id, Group.all, :id, :groupname) %>