app2/app/views/people/show.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 ORDER BY "groups"."id" ASC LIMIT 1  [["id", 1]]
---
  <strong>Group name:</strong>
  <%= @person.group.groupname %>