app2/app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups"
---
	def index
		@group = Group.all

INSERT INTO "groups" ("created_at", "groupname", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Wed, 26 Feb 2014 10:03:48 UTC +00:00], ["groupname", "ABC"], ["updated_at", Wed, 26 Feb 2014 10:03:48 UTC +00:00]]
---
	def create
  		@group = Group.new(group_params)

  		@group.save

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 1]]
---
	def destroy
		@group = Group.find(params[:id])
  		@group.destroy