app2/app/controllers/people_controller.rb

SELECT "groups".* FROM "groups"
---
	def index
		@person = Person.all
		@group = Group.all