app2/app/views/groups/index.html.erb

SELECT "groups".* FROM "groups"
---
      <td><center><%= groups.id %></center></td>
      <td><center><%= groups.groupname %></center></td>