app2/app/views/groups/show.html.erb

SELECT "people".* FROM "people" WHERE "people"."group_id" = $1  [["group_id", 1]]
---

  <% @group.people.each do |person| %>